ATsupportum/src/Documents/СчетНаОплату_ат/СчетНаОплату_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату_ат</name>
  <basedOn>Document.Заявка_ат</basedOn>
  <basedOn>Document.Согласование_ат</basedOn>
  <registerRecords>AccountingRegister.Клиентский_ат</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>DefinedType.ТипВнешнегоНомера_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплатыПланируемая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДокументОснование</name>
    <type>
      <types>DocumentRef.Согласование_ат</types>
      <types>DocumentRef.ФиксацияРабот_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьСОперативногоБаланса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КомментарийВнутренний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифрыНомера</name>
    <comment>!!!rename</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КосвенныеСвязиЗаданий</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Задание</name>
      <type>
        <types>DocumentRef.Задание_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Основания</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.Согласование_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реализации</name>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ATsupportum/src/Enums/РегистрыСинхронизацииДокументов_ат/РегистрыСинхронизацииДокументов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РегистрыСинхронизацииДокументов_ат</name>
  <enumValues>
    <name>СинхронизацияСчетовНаОплату_ат</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияРеализаций_ат</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Catalogs/СинхронизированныеПечатныеФормы_ат/СинхронизированныеПечатныеФормы_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СинхронизированныеПечатныеФормы_ат</name>
  <attributes>
    <name>ВнешняяПечатнаяФорма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрСинхронизации</name>
    <type>
      <types>EnumRef.РегистрыСинхронизацииДокументов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайлаПоУмолчаниюСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекстаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоДокументу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Documents/СчетНаОплату_ат/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВнешнийНомер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПустаяСтрока(Данные.ВнешнийНомер) Тогда
		
		Попытка
			
			ВнешнийНомерКакЧисло = Число(Данные.ВнешнийНомер);
			Если ВнешнийНомерКакЧисло = 0 Тогда
				
				Если ПустаяСтрока(Данные.Номер) Тогда
					ВнешнийНомер = "новый";
				Иначе
					ВнешнийНомер = Формат(Число(Данные.Номер), "ЧГ=");
				КонецЕсли;
				
			Иначе
				ВнешнийНомер = Данные.ВнешнийНомер;
			КонецЕсли;
			
		Исключение
			ВнешнийНомер = Данные.ВнешнийНомер;
		КонецПопытки;
		
	Иначе
		
		Если ПустаяСтрока(Данные.Номер) Тогда
			ВнешнийНомер = "новый";
		Иначе
			ВнешнийНомер = Формат(Число(Данные.Номер), "ЧГ=");
		КонецЕсли;
		
	КонецЕсли;
	
	Представление = "Счёт " + ВнешнийНомер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy");
	
	//ПредставлениеСогласования = "";
	//Основания = Данные.Основания;
	//
	//Если Основания.Количество() > 0 Тогда
	//	
	//	Если Основания.Количество() = 1 Тогда
	//		
	//		Согласование = Основания[0].Основание;
	//		ПредставлениеСогласования = " по согласованию " + Согласование.Номер + " от " + Согласование.Дата;
	//		
	//	Иначе
	//		
	//		ПредставлениеСогласования = " по согласованиям: ";
	//		
	//		Для Каждого СтрокаОснований Из Основания Цикл
	//			
	//			Согласование = СтрокаОснований.Основание;
	//			
	//			ПредставлениеСогласования = ПредставлениеСогласования + " " + Согласование.Номер + " от " + Согласование.Дата + ", ";
	//			
	//		КонецЦикла;
	//		
	//		ПредставлениеСогласования = Лев(ПредставлениеСогласования, СтрДлина(ПредставлениеСогласования) - 2);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Представление = "Счёт № " + Выборка.НомерСчета + " от " + Формат(Выборка.ДатаСчета, "ДЛФ=D")
	//	+ ?(ЗначениеЗаполнено(Выборка.Период), " (за " + Даты_КлиентСервер_ат.ПолучитьПредставлениеМесяца(Выборка.Период) + ")", "")
	//	+ ПредставлениеСогласования; 
	
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СинхронизированныеПечатныеФормы_ат.РегистрСинхронизации,
		|	СинхронизированныеПечатныеФормы_ат.ИмяМакета,
		|	СинхронизированныеПечатныеФормы_ат.Наименование,
		|	СинхронизированныеПечатныеФормы_ат.ВнешняяПечатнаяФорма,
		|	СинхронизированныеПечатныеФормы_ат.Порядок,
		|	СинхронизированныеПечатныеФормы_ат.ИспользоватьДляОтправки,
		|	СинхронизированныеПечатныеФормы_ат.ТипФайлаПоУмолчаниюСтрокой,
		|	СинхронизированныеПечатныеФормы_ат.ШаблонТекстаПисьма
		|ИЗ
		|	Справочник.СинхронизированныеПечатныеФормы_ат КАК СинхронизированныеПечатныеФормы_ат
		|ГДЕ
		|	НЕ СинхронизированныеПечатныеФормы_ат.ПометкаУдаления
		|	И СинхронизированныеПечатныеФормы_ат.РегистрСинхронизации = &РегистрСинхронизации");
	Запрос.УстановитьПараметр("РегистрСинхронизации", Перечисления.РегистрыСинхронизацииДокументов_ат.СинхронизацияСчетовНаОплату_ат);
	
	ВыборкаРезультатов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультатов.Следующий() Цикл
		
		КомандаПечати = КомандыПечати.Добавить();
		
		КомандаПечати.Идентификатор = ВыборкаРезультатов.ИмяМакета;
		КомандаПечати.Представление = ВыборкаРезультатов.Наименование;
		КомандаПечати.СписокФорм    = "ФормаСпискаИВыбора,ФормаДокумента";
		КомандаПечати.Порядок		= ВыборкаРезультатов.Порядок;
		
		Если НЕ ПустаяСтрока(ВыборкаРезультатов.ТипФайлаПоУмолчаниюСтрокой) Тогда
			КомандаПечати.ФорматСохранения = ТипФайлаТабличногоДокумента[ВыборкаРезультатов.ТипФайлаПоУмолчаниюСтрокой];
		КонецЕсли;
		
		КомандаПечати.ДополнительныеПараметры.Вставить("РегистрСинхронизации", 		ВыборкаРезультатов.РегистрСинхронизации);
		КомандаПечати.ДополнительныеПараметры.Вставить("ВнешняяПечатнаяФорма", 		ВыборкаРезультатов.ВнешняяПечатнаяФорма);
		КомандаПечати.ДополнительныеПараметры.Вставить("ИспользоватьДляОтправки", 	ВыборкаРезультатов.ИспользоватьДляОтправки);
		
		Если НЕ ПустаяСтрока(ВыборкаРезультатов.ШаблонТекстаПисьма) Тогда
			КомандаПечати.ДополнительныеПараметры.Вставить("ШаблонТекстаПисьма", 	ВыборкаРезультатов.ШаблонТекстаПисьма);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Финансы_ат.ПечатьФинДокумента(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры 

Функция   ПолучитьПланируемуюДатуОплаты(Дата, Договор) Экспорт
	
	СрокОплатыВДнях = ?(Договор.Родитель.Пустая(), Договор.СрокОплатыВДнях, Договор.Родитель.СрокОплатыВДнях); 
	
	Если СрокОплатыВДнях = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат ПродолжительностьПроцессов_Сервер_ат.ПолучитьДату(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()), СрокОплатыВДнях);
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаменитьПараметрыВТекстеПисьма(Счет, Текст, КоличествоОтправляемых = 1, РазныеДоговоры = Ложь, ОдинаковыйПериод = Истина) Экспорт
	
	Параметр = "&Счет";
	Если СтрНайти(Текст, Параметр) > 0 Тогда
		
		Текст = СтрЗаменить(Текст, Параметр, ?(КоличествоОтправляемых > 1, "Счета", "Счёт"));
		
	КонецЕсли;
	
	Уведомления_ат.ЗаменитьПараметрыВТекстеПисьмаФинансовогоДокумента(Счет, Текст, КоличествоОтправляемых, РазныеДоговоры, ОдинаковыйПериод);
	
КонецПроцедуры

Функция   ПолучитьТемуПисьма(Документ, КоличествоОбъектов, ПредставлениеПериода = "") Экспорт
	
	Возврат Уведомления_ат.ПолучитьТемуПисьмаДляОтправкиДокумента(Документ, "Счета на оплату", КоличествоОбъектов, ПредставлениеПериода);
	
КонецФункции
